const historyarray = [
  {
    year: "٢٠٠٦",
    description:
      'الدراسة والتمهيد الشرعي والقضائي: حصل الشيخ مالك الشعار على أسس علمية ودينية قوية أهلته ليشغل منصب قاضي شرع في طرابلس، مؤكداً مكانته كصاحب مرجعية دينية وقانونية ثابتة.',
  },
  {
    year: " ٢٠٠٦",
    description:' انتُخب المفتي رسميًا بعد حصوله على 71 صوتًا مقابل 37 لمنافسه، ليصبح المفتي السابع لطرابلس والشمال منذ استقلال لبنان. تمت الانتخابات وسط مشاركة شخصيات سياسية بارزة، ممّا يعكس إجماعًا سياسيًا حوله',
  },
  {
    year: "٢٠١٢-٢٠١٣",
    description:
      'ديسمبر 2012: تلقى المفتي تهديدات بالقتل بعد تصاعد الاشتباكات في طرابلس، وأعلن من أوروبا أنه لن يعود إلى لبنان مؤقتًا لأسباب أمنية. …استمر المنفى لمدة 7 أشهر، الأمر الذي أدى إلى فراغ مؤسسي في دار الفتوى، وازدياد نفوذ جماعات دينية متطرفة'
  },
  {
    year: "٢٠١٣",
    description:
      'عاد إلى لبنان تحت حماية أمنية مشددة، مؤكدًا أن “لبنان يحتاج الجميع”.عند وصوله، دعا إلى التهدئة والمحاسبة القانونية إثر التفجيرات التي هزت طرابلس.',
  },
  {
    year: "٢٠١٤",
    description:
      'قاد مبادرة "وثيقة طرابلس" التي عُرفت أيضًا بـ "ميثاق السلم الأهلي"، وجمعت شخصيات دينية وسياسية واقتصادية لتهدئة الوضع في المدينة. وضعت الوثيقة دُستورًا مدنيًا محليًا لترسيخ السلم الاجتماعي وتخليص طرابلس من الاستقطاب المسلح.',
  },
  {
    year: "٢٠١٩",
    description: 'أعلن المفتي دعمه للاحتجاجات الشعبية التي انطلقت في أكتوبر 2019، واصفًا إيّاها بأنّها “ضمير شعب عظيم ونبيل”.وجّه نصائح للمشايخ بعدم ارتداء اللباس الديني أثناء التظاهر لتجنب تسييس الحراك دينيًا.',
  },
];
export default historyarray;
